Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NotFullyConnected
The calculation could not be executed as configured. The network is not continuous. Check for disconnects before analyzing this network.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorOverConstrained
The calculation could not be performed. Verify that demand flow is specified for all required elements.